khrisperry/KegScaleESPDisplay/touchscreen/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# ESP32-S3-WROOM-1-N16R8
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# Use the board's full 16 MB flash and reserve OTA-capable app slots.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# 8 MB octal PSRAM used by the RGB framebuffer/LVGL.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_FETCH_INSTRUCTIONS=y
CONFIG_SPIRAM_RODATA=y
CONFIG_SPIRAM_USE_MALLOC=y

CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# Public CA bundle for touchscreen HTTPS OTA.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_CMN=y

# We use our own UI, not LVGL's demo/example applications.
CONFIG_LV_BUILD_EXAMPLES=n
CONFIG_LV_BUILD_DEMOS=n

# Enable LVGL's floating-point formatter. Without this, its built-in printf
# renders formats such as %.0f as literal text like "f".
CONFIG_LV_USE_FLOAT=y

# Fonts used by the 480x480 UI.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y

# Always powered Wi-Fi controller; no BLE stack or deep sleep.
CONFIG_BT_ENABLED=n
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LWIP_MAX_SOCKETS=12

# Resolve discovered .local scale names after DHCP changes.
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y

# Synchronized driver-owned RGB frames.
CONFIG_BSP_LCD_RGB_BUFFER_NUMS=2
CONFIG_BSP_LCD_RGB_BOUNCE_BUFFER_HEIGHT=20
